app/actions/projects/save.rb

  promises :project

  executed do
    context.project.save!
---
INSERT INTO "projects" ("name", "repository_url", "branch", "cluster_id", "autodeploy", "dockerfile_path", "docker_build_context_directory", "docker_command", "predeploy_command", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"