app/controllers/clusters_controller.rb

  def create
    @cluster = current_user.clusters.new(cluster_params)

    # Uncomment to authorize with Pundit
    # authorize @cluster

    respond_to do |format|
      if @cluster.save
---
INSERT INTO "clusters" ("name", "kubeconfig", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_cluster
    @cluster = current_user.clusters.find(params[:id])
---
SELECT "clusters".* FROM "clusters" WHERE "clusters"."user_id" = $1 AND "clusters"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]